cases/airfoil_run/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

24
(
    inlet-l
    {
        type            patch;
        nFaces          71;
        startFace       58294;
    }
    airfoil-l1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          71;
        startFace       58365;
    }
    empty-1
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          4615;
        startFace       58436;
    }
    empty-2
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          4615;
        startFace       63051;
    }
    wall-l1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          104;
        startFace       67666;
    }
    airfoil-l2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          104;
        startFace       67770;
    }
    empty-3
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          6760;
        startFace       67874;
    }
    empty-4
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          6760;
        startFace       74634;
    }
    wall-l2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          51;
        startFace       81394;
    }
    outlet-l
    {
        type            patch;
        nFaces          65;
        startFace       81445;
    }
    empty-5
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          3315;
        startFace       81510;
    }
    empty-6
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          3315;
        startFace       84825;
    }
    outlet-h
    {
        type            patch;
        nFaces          65;
        startFace       88140;
    }
    wall-h2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          51;
        startFace       88205;
    }
    empty-7
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          3315;
        startFace       88256;
    }
    empty-8
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          3315;
        startFace       91571;
    }
    airfoil-h2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          104;
        startFace       94886;
    }
    wall-h1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          104;
        startFace       94990;
    }
    empty-9
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          6760;
        startFace       95094;
    }
    empty-10
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          6760;
        startFace       101854;
    }
    inlet-h
    {
        type            patch;
        nFaces          71;
        startFace       108614;
    }
    airfoil-h1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          71;
        startFace       108685;
    }
    empty-11
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          4615;
        startFace       108756;
    }
    empty-12
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          4615;
        startFace       113371;
    }
)

// ************************************************************************* //
