cases/airfoil_run/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (51.0527 0 0);

boundaryField
{
    inlet-l
    {
        type            freestreamVelocity;
        freestreamValue uniform (51.0527 0 0);
        value           uniform (51.0527 0 0);
    }
    airfoil-l1
    {
        type            noSlip;
    }
    empty-1
    {
        type            empty;
    }
    empty-2
    {
        type            empty;
    }
    wall-l1
    {
        type            freestreamVelocity;
        freestreamValue uniform (51.0527 0 0);
        value           uniform (51.0527 0 0);
    }
    airfoil-l2
    {
        type            noSlip;
    }
    empty-3
    {
        type            empty;
    }
    empty-4
    {
        type            empty;
    }
    wall-l2
    {
        type            freestreamVelocity;
        freestreamValue uniform (51.0527 0 0);
        value           uniform (51.0527 0 0);
    }
    outlet-l
    {
        type            freestreamVelocity;
        freestreamValue uniform (51.0527 0 0);
        value           uniform (51.0527 0 0);
    }
    empty-5
    {
        type            empty;
    }
    empty-6
    {
        type            empty;
    }
    outlet-h
    {
        type            freestreamVelocity;
        freestreamValue uniform (51.0527 0 0);
        value           uniform (51.0527 0 0);
    }
    wall-h2
    {
        type            freestreamVelocity;
        freestreamValue uniform (51.0527 0 0);
        value           uniform (51.0527 0 0);
    }
    empty-7
    {
        type            empty;
    }
    empty-8
    {
        type            empty;
    }
    airfoil-h2
    {
        type            noSlip;
    }
    wall-h1
    {
        type            freestreamVelocity;
        freestreamValue uniform (51.0527 0 0);
        value           uniform (51.0527 0 0);
    }
    empty-9
    {
        type            empty;
    }
    empty-10
    {
        type            empty;
    }
    inlet-h
    {
        type            freestreamVelocity;
        freestreamValue uniform (51.0527 0 0);
        value           uniform (51.0527 0 0);
    }
    airfoil-h1
    {
        type            noSlip;
    }
    empty-11
    {
        type            empty;
    }
    empty-12
    {
        type            empty;
    }
}


// ************************************************************************* //
