cases/airfoil_run/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    inlet-l
    {
        type            freestreamPressure;
        freestreamValue uniform 100000;
        supersonic      0;
        value           uniform 100000;
    }
    airfoil-l1
    {
        type            zeroGradient;
    }
    empty-1
    {
        type            empty;
    }
    empty-2
    {
        type            empty;
    }
    wall-l1
    {
        type            freestreamPressure;
        freestreamValue uniform 100000;
        supersonic      0;
        value           uniform 100000;
    }
    airfoil-l2
    {
        type            zeroGradient;
    }
    empty-3
    {
        type            empty;
    }
    empty-4
    {
        type            empty;
    }
    wall-l2
    {
        type            freestreamPressure;
        freestreamValue uniform 100000;
        supersonic      0;
        value           uniform 100000;
    }
    outlet-l
    {
        type            freestreamPressure;
        freestreamValue uniform 100000;
        supersonic      0;
        value           uniform 100000;
    }
    empty-5
    {
        type            empty;
    }
    empty-6
    {
        type            empty;
    }
    outlet-h
    {
        type            freestreamPressure;
        freestreamValue uniform 100000;
        supersonic      0;
        value           uniform 100000;
    }
    wall-h2
    {
        type            freestreamPressure;
        freestreamValue uniform 100000;
        supersonic      0;
        value           uniform 100000;
    }
    empty-7
    {
        type            empty;
    }
    empty-8
    {
        type            empty;
    }
    airfoil-h2
    {
        type            zeroGradient;
    }
    wall-h1
    {
        type            freestreamPressure;
        freestreamValue uniform 100000;
        supersonic      0;
        value           uniform 100000;
    }
    empty-9
    {
        type            empty;
    }
    empty-10
    {
        type            empty;
    }
    inlet-h
    {
        type            freestreamPressure;
        freestreamValue uniform 100000;
        supersonic      0;
        value           uniform 100000;
    }
    airfoil-h1
    {
        type            zeroGradient;
    }
    empty-11
    {
        type            empty;
    }
    empty-12
    {
        type            empty;
    }
}


// ************************************************************************* //
