cases/airfoil_run/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet-l
    {
        type            calculated;
        value           uniform 0;
    }
    airfoil-l1
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    empty-1
    {
        type            empty;
    }
    empty-2
    {
        type            empty;
    }
    wall-l1
    {
        type            calculated;
        value           uniform 0;
    }
    airfoil-l2
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    empty-3
    {
        type            empty;
    }
    empty-4
    {
        type            empty;
    }
    wall-l2
    {
        type            calculated;
        value           uniform 0;
    }
    outlet-l
    {
        type            calculated;
        value           uniform 0;
    }
    empty-5
    {
        type            empty;
    }
    empty-6
    {
        type            empty;
    }
    outlet-h
    {
        type            calculated;
        value           uniform 0;
    }
    wall-h2
    {
        type            calculated;
        value           uniform 0;
    }
    empty-7
    {
        type            empty;
    }
    empty-8
    {
        type            empty;
    }
    airfoil-h2
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    wall-h1
    {
        type            calculated;
        value           uniform 0;
    }
    empty-9
    {
        type            empty;
    }
    empty-10
    {
        type            empty;
    }
    inlet-h
    {
        type            calculated;
        value           uniform 0;
    }
    airfoil-h1
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    empty-11
    {
        type            empty;
    }
    empty-12
    {
        type            empty;
    }
}


// ************************************************************************* //
