cases/airfoil_run/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet-l
    {
        type            calculated;
        value           uniform 0;
    }
    airfoil-l1
    {
        type            calculated;
        value           nonuniform List<scalar> 
71
(
192.51
191.908
190.984
191.29
192.49
193.008
193.174
193.226
...
)
;
    }
    empty-1
    {
        type            empty;
    }
    empty-2
    {
        type            empty;
    }
    wall-l1
    {
        type            calculated;
        value           uniform 0;
    }
    airfoil-l2
    {
        type            calculated;
        value           nonuniform List<scalar> 
104
(
173.683
173.721
173.75
173.775
173.795
173.813
173.826
173.831
...
)
;
    }
    empty-3
    {
        type            empty;
    }
    empty-4
    {
        type            empty;
    }
    wall-l2
    {
        type            calculated;
        value           uniform 0;
    }
    outlet-l
    {
        type            calculated;
        value           uniform 0;
    }
    empty-5
    {
        type            empty;
    }
    empty-6
    {
        type            empty;
    }
    outlet-h
    {
        type            calculated;
        value           uniform 0;
    }
    wall-h2
    {
        type            calculated;
        value           uniform 0;
    }
    empty-7
    {
        type            empty;
    }
    empty-8
    {
        type            empty;
    }
    airfoil-h2
    {
        type            calculated;
        value           nonuniform List<scalar> 
104
(
173.704
173.737
173.766
173.788
173.805
173.821
173.833
173.836
...
)
;
    }
    wall-h1
    {
        type            calculated;
        value           uniform 0;
    }
    empty-9
    {
        type            empty;
    }
    empty-10
    {
        type            empty;
    }
    inlet-h
    {
        type            calculated;
        value           uniform 0;
    }
    airfoil-h1
    {
        type            calculated;
        value           nonuniform List<scalar> 
71
(
192.517
191.964
191.1
191.035
192.169
192.728
192.937
193.013
...
)
;
    }
    empty-11
    {
        type            empty;
    }
    empty-12
    {
        type            empty;
    }
}


// ************************************************************************* //
